"""
Необхідно написати програму на Python, яка імітує велику кількість кидків кубиків, обчислює суми чисел, 
які випадають на кубиках, і визначає ймовірність кожної можливої суми.

Створіть симуляцію, де два кубики кидаються велику кількість разів. Для кожного кидка визначте суму чисел, 
які випали на обох кубиках. Підрахуйте, скільки разів кожна можлива сума (від 2 до 12) з’являється у процесі симуляції. 
Використовуючи ці дані, обчисліть імовірність кожної суми.

На основі проведених імітацій створіть таблицю або графік, який відображає ймовірності кожної суми, 
виявлені за допомогою методу Монте-Карло.

Порівняйте отримані за допомогою методу Монте-Карло результати з аналітичними розрахунками, наведеними в таблиці вище.

- Програмно реалізовано алгоритм для моделювання кидання двох ігрових кубиків і побудови таблиці сум та їх 
імовірностей за допомогою методу Монте-Карло.
- Код виконується та імітує велику кількість кидків кубиків, обчислює суми чисел, які випадають на кубиках, 
підраховує, скільки разів кожна можлива сума з’являється у процесі симуляції, і визначає ймовірність кожної можливої суми.
- Створено таблицю або графік, який відображає ймовірності кожної суми, виявлені за допомогою методу Монте-Карло.
- Зроблено висновки щодо правильності розрахунків шляхом порівняння отриманих за допомогою методу Монте-Карло результатів 
та результатів аналітичних розрахунків. Висновки оформлено у вигляді файлу readme.md фінального завдання.
"""

import random

def two_dice_sum(experiments = 100):
    exp_results = [0]*11
    for _ in range(experiments):
        dice1 = random.randint(1,6)
        dice2 = random.randint(1,6)
        exp_results[dice1+dice2-2] += 1
    return [ i/experiments for i in exp_results ]

theoretical_result = [1/36, 2/36, 3/36, 4/36, 5/36, 6/36, 5/36, 4/36, 3/36, 2/36, 1/36]

print("="*30)
print("For 100 experiments: ")
result = two_dice_sum(100)
for i in range(0, 11):
    print(f"{i}: in theory: {theoretical_result[i]:.2%}, monte-carlo method: {result[i]:.2%}")

print("="*30)
print("For 10000 experiments: ")
result = two_dice_sum(10000)
for i in range(0, 11):
    print(f"{i}: in theory: {theoretical_result[i]:.2%}, monte-carlo method: {result[i]:.2%}")

print("="*30)
print("For 1000000 experiments: ")
result = two_dice_sum(1000000)
for i in range(0, 11):
    print(f"{i}: in theory: {theoretical_result[i]:.2%}, monte-carlo method: {result[i]:.2%}")
